class Key_word:
    MPRS_keyword = {
        '參數建議系統':100,
        '材料':8,
        'FeSiCr':8,
        'NiFe':8,
        '高磁導率':8,
        '低鐵損':8,
        '高最大拉伸':8,
        '高拉伸強度':8,
        '客製化':8,
        '參數':8,
        '最佳化':8,
        '建議':8,
    }

    TSDS_keyword = {
        '生產履歷':100,
        '剖面':100,
        '縱切面':100,
    }

    WCPS_keyword = {
        '工件特性預測':100,
        '預測':8,
        '預估':8,
        '逐層圖像':8,
        '磁特性':8,
        '圓環':8,
        '狗骨頭':8,
        '積層圖像':8,
        '積層影像':8,
        '積層製造圖像':8,
        '積層製造影像':8,
    }
